RT-Thread/rt-thread/bsp/freescale/platform/devices/MKL43Z4/include/MKL43Z4_extension.h
/*! @brief Set the BPDLCD63 field to a new value. */
#define LCD_WR_WF8B_BPDLCD63(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPDLCD63_MASK, LCD_WF8B_BPDLCD63(value)))
#define LCD_BWR_WF8B_BPDLCD63(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPDLCD63_SHIFT), LCD_WF8B_BPDLCD63_SHIFT, LCD_WF8B_BPDLCD63_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPDLCD38[3] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase D
 * - 0b1 - LCD segment on or LCD backplane active for phase D
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPDLCD38 field. */
#define LCD_RD_WF8B_BPDLCD38(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPDLCD38_MASK) >> LCD_WF8B_BPDLCD38_SHIFT)
#define LCD_BRD_WF8B_BPDLCD38(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPDLCD38_SHIFT, LCD_WF8B_BPDLCD38_WIDTH))

/*! @brief Set the BPDLCD38 field to a new value. */
#define LCD_WR_WF8B_BPDLCD38(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPDLCD38_MASK, LCD_WF8B_BPDLCD38(value)))
#define LCD_BWR_WF8B_BPDLCD38(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPDLCD38_SHIFT), LCD_WF8B_BPDLCD38_SHIFT, LCD_WF8B_BPDLCD38_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPDLCD56[3] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase D
 * - 0b1 - LCD segment on or LCD backplane active for phase D
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPDLCD56 field. */
#define LCD_RD_WF8B_BPDLCD56(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPDLCD56_MASK) >> LCD_WF8B_BPDLCD56_SHIFT)
#define LCD_BRD_WF8B_BPDLCD56(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPDLCD56_SHIFT, LCD_WF8B_BPDLCD56_WIDTH))

/*! @brief Set the BPDLCD56 field to a new value. */
#define LCD_WR_WF8B_BPDLCD56(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPDLCD56_MASK, LCD_WF8B_BPDLCD56(value)))
#define LCD_BWR_WF8B_BPDLCD56(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPDLCD56_SHIFT), LCD_WF8B_BPDLCD56_SHIFT, LCD_WF8B_BPDLCD56_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPDLCD40[3] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase D
 * - 0b1 - LCD segment on or LCD backplane active for phase D
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPDLCD40 field. */
#define LCD_RD_WF8B_BPDLCD40(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPDLCD40_MASK) >> LCD_WF8B_BPDLCD40_SHIFT)
#define LCD_BRD_WF8B_BPDLCD40(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPDLCD40_SHIFT, LCD_WF8B_BPDLCD40_WIDTH))

/*! @brief Set the BPDLCD40 field to a new value. */
#define LCD_WR_WF8B_BPDLCD40(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPDLCD40_MASK, LCD_WF8B_BPDLCD40(value)))
#define LCD_BWR_WF8B_BPDLCD40(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPDLCD40_SHIFT), LCD_WF8B_BPDLCD40_SHIFT, LCD_WF8B_BPDLCD40_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPDLCD31[3] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase D
 * - 0b1 - LCD segment on or LCD backplane active for phase D
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPDLCD31 field. */
#define LCD_RD_WF8B_BPDLCD31(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPDLCD31_MASK) >> LCD_WF8B_BPDLCD31_SHIFT)
#define LCD_BRD_WF8B_BPDLCD31(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPDLCD31_SHIFT, LCD_WF8B_BPDLCD31_WIDTH))

/*! @brief Set the BPDLCD31 field to a new value. */
#define LCD_WR_WF8B_BPDLCD31(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPDLCD31_MASK, LCD_WF8B_BPDLCD31(value)))
#define LCD_BWR_WF8B_BPDLCD31(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPDLCD31_SHIFT), LCD_WF8B_BPDLCD31_SHIFT, LCD_WF8B_BPDLCD31_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPDLCD12[3] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase D
 * - 0b1 - LCD segment on or LCD backplane active for phase D
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPDLCD12 field. */
#define LCD_RD_WF8B_BPDLCD12(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPDLCD12_MASK) >> LCD_WF8B_BPDLCD12_SHIFT)
#define LCD_BRD_WF8B_BPDLCD12(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPDLCD12_SHIFT, LCD_WF8B_BPDLCD12_WIDTH))

/*! @brief Set the BPDLCD12 field to a new value. */
#define LCD_WR_WF8B_BPDLCD12(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPDLCD12_MASK, LCD_WF8B_BPDLCD12(value)))
#define LCD_BWR_WF8B_BPDLCD12(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPDLCD12_SHIFT), LCD_WF8B_BPDLCD12_SHIFT, LCD_WF8B_BPDLCD12_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPDLCD39[3] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase D
 * - 0b1 - LCD segment on or LCD backplane active for phase D
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPDLCD39 field. */
#define LCD_RD_WF8B_BPDLCD39(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPDLCD39_MASK) >> LCD_WF8B_BPDLCD39_SHIFT)
#define LCD_BRD_WF8B_BPDLCD39(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPDLCD39_SHIFT, LCD_WF8B_BPDLCD39_WIDTH))

/*! @brief Set the BPDLCD39 field to a new value. */
#define LCD_WR_WF8B_BPDLCD39(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPDLCD39_MASK, LCD_WF8B_BPDLCD39(value)))
#define LCD_BWR_WF8B_BPDLCD39(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPDLCD39_SHIFT), LCD_WF8B_BPDLCD39_SHIFT, LCD_WF8B_BPDLCD39_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPDLCD3[3] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase D
 * - 0b1 - LCD segment on or LCD backplane active for phase D
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPDLCD3 field. */
#define LCD_RD_WF8B_BPDLCD3(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPDLCD3_MASK) >> LCD_WF8B_BPDLCD3_SHIFT)
#define LCD_BRD_WF8B_BPDLCD3(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPDLCD3_SHIFT, LCD_WF8B_BPDLCD3_WIDTH))

